Repository: Shunseii/bahar
Catalog: packages/i18n/locales/*.po
Languages: ar

source: This will delete the local copy of your data stored in this browser and download a fresh copy from the server. Your data on the server will not be affected. Use this if you're experiencing sync errors or seeing outdated data.
ar: سيؤدي هذا إلى حذف النسخة المحلية من بياناتك المخزنة في هذا المتصفح وتنزيل نسخة جديدة من الخادم. لن تتأثر بياناتك على الخادم. استخدم هذا إذا كنت تواجه أخطاء في المزامنة أو ترى بيانات قديمة.

source: This will permanently delete all your words, flashcards, and decks. This action cannot be undone.
ar: سيؤدي هذا إلى حذف جميع كلماتك وبطاقاتك ومجموعاتك نهائيًا. لا يمكن التراجع عن هذا الإجراء.

source: Time:
ar: الوقت:

source: To review
ar: للمراجعة

source: Toggle Menu
ar: تبديل القائمة

source: Total
ar: الإجمالي

source: Translation
ar: الترجمة

source: Triptote
ar: معرب

source: Try a different search term
ar: جرب مصطلح بحث مختلف

source: Type
ar: الجنس

source: Types
ar: أقسام

source: Uh oh! Something went wrong :/
ar: آه! حدث خطأ ما!

source: Unable to connect to remote database.
ar: غير قادر على الاتصال بقاعدة البيانات البعيدة.

source: Unknown error.
ar: خطأ غير معروف.

source: Value must be {0} or greater
ar: يجب أن تكون القيمة {0} أو أكبر

source: Value must be {0} or less
ar: يجب أن تكون القيمة {0} أو أقل

source: Verb
ar: فعل

source: Verb form
ar: صيغة الفعل

source: Verb Morphology
ar: صرف الفعل

source: Verbal noun forms (masadir) of the verb.
ar: مصادر للفعل.

source: Verbal nouns
ar: المصادر

source: Verbal Nouns (Masadir)
ar: المصادر

source: We can't reach our servers right now. Check your connection and try again.
ar: لا يمكننا الوصول إلى خوادمنا الآن. تحقق من اتصالك وحاول مرة أخرى.

source: We're having trouble with your account setup. Please try again.
ar: نواجه مشكلة في إعداد حسابك. حاول مرة أخرى من فضلك.

source: Welcome to Bahar!
ar: مرحباً بكم في بحر!

source: Word
ar: الكلمة

source: Word added successfully
ar: تمت إضافة الكلمة بنجاح

source: Word deleted successfully
ar: تم حذف الكلمة بنجاح

source: Word not found
ar: الكلمة غير موجودة

source: Word updated successfully
ar: تم تحديث الكلمة بنجاح

source: Words that have any of these tags will be included in the deck.
ar: الكلمات التي تحتوي على أي من هذه العلامات ستُدرج في المجموعة.

source: Words that have the opposite meaning.
ar: الكلمات التي لها معنى عكسي.

source: You do not have access to upload schema migrations.
ar: ليس لديك إذن لتحميل ترحيلات المخطط.

source: You have {0} cards in your backlog when you're ready.
ar: لديك {0} بطاقات متراكمة عندما تكون جاهزًا.

source: You have no decks yet.
ar: ليس لديك أي مجموعات بعد.

source: You have no words in your dictionary yet.
ar: ليس لديك أي كلمات في قاموسك بعد.

source: Your account needs maintenance. We've been notified. Please try again later.
ar: حسابك يحتاج إلى صيانة. تم إخطارنا. حاول مرة أخرى لاحقا من فضلك.

source: Your deck was not created. Please try again.
ar: لم يتم إنشاء مجموعتك. يرجى المحاولة مرة أخرى.

source: Your deck was not updated. Please try again.
ar: لم يتم تحديث مجموعتك. يرجى المحاولة مرة أخرى.

source: Your Dictionary
ar: معجمك

source: Your dictionary has been deleted.
ar: حذف معجمك.

source: Your dictionary has been downloaded.
ar: تم تحميل معجمك.

source: Your dictionary has been updated!
ar: تم تحديث معجمك!

source: Your dictionary is empty
ar: معجمك فارغ

source: Your dictionary is not valid. Please fix the errors and upload it again.
ar: معجمك غير صالح. صوب الأخطاء و استورد مرة أخرى من فضلك.

source: محمد is a triptote;
ar: كلمة «محمد» هي معرب.

source: موسى is indeclinable.
ar: كلمة «موسى» هي مبنى.

source: يوسف is a diptote;
ar: كلمة «يوسف» هي ممنوع من الصرف.
