Repository: Shunseii/bahar
Catalog: packages/i18n/locales/*.po
Languages: ar

source: {0, plural, one {card left} other {cards left}}
ar: {0, plural, one {بطاقة متبقية} other {بطاقات متبقية}}

source: {0} / {1} cards
ar: {0} / {1} بطاقات

source: {0} cards due
ar: {0} بطاقات مستحقة

source: {0} cards have been rescheduled.
ar: تمت إعادة جدولة {0} بطاقات.

source: {0} total
ar: {0} إجمالي

source: {hydrationSkippedCount, plural, one {# entry was skipped due to data issues. Your data is preserved, but you won't be able to search for the entry that wasn't loaded.} other {# entries were skipped due to data issues. Your data is preserved, but you won't be able to search for any entries that weren't loaded.}}
ar: {hydrationSkippedCount, plural, one {تم تخطي إدخال واحد بسبب مشاكل في البيانات. بياناتك محفوظة، لكن لن تتمكن من البحث عن الإدخال الذي لم يتم تحميله.} two {تم تخطي إدخالين بسبب مشاكل في البيانات. بياناتك محفوظة، لكن لن تتمكن من البحث عن الإدخالات التي لم يتم تحميلها.} few {تم تخطي # إدخالات بسبب مشاكل في البيانات. بياناتك محفوظة، لكن لن تتمكن من البحث عن الإدخالات التي لم يتم تحميلها.} many {تم تخطي # إدخالًا بسبب مشاكل في البيانات. بياناتك محفوظة، لكن لن تتمكن من البحث عن الإدخالات التي لم يتم تحميلها.} other {تم تخطي # إدخال بسبب مشاكل في البيانات. بياناتك محفوظة، لكن لن تتمكن من البحث عن الإدخالات التي لم يتم تحميلها.}}

source: {skippedCount} entries were skipped due to data corruption.
ar: تم تخطي {skippedCount} إدخالات بسبب تلف البيانات.

source: {totalHits, plural, one {result} other {results}}
ar: {totalHits, plural, one {نتيجة} two {نتيجتان} few {نتائج} many {نتيجة} other {نتيجة}}

source: {totalResults, plural, one {{totalResults} result} other {{totalResults} results}}
ar: {totalResults, plural, one {{totalResults} نتيجة} two {{totalResults} نتيجتان} few {{totalResults} نتائج} many {{totalResults} نتيجة} other {{totalResults} نتيجة}}

source: {val, plural, one {Cannot exceed # character} other {Cannot exceed # characters}}
ar: {val, plural, one {لا يمكن تجاوز حرف واحد} two {لا يمكن تجاوز حرفين} few {لا يمكن تجاوز # حروف} many {لا يمكن تجاوز # حرفا} other {لا يمكن تجاوز # حرف}}

source: {val, plural, one {Must be at least # character} other {Must be at least # characters}}
ar: {val, plural, one {يجب أن يكون على الأقل واحد حرف} two {يجب أن يكون على الأقل حرفين} few {يجب أن يكون على الأقل # حروف} many {يجب أن يكون على الأقل # حرفا} other {يجب أن يكون على الأقل # حرف}}

source: A noun, adjective, adverb or pronoun, and anything that is not a verb or preposition.
ar: غير فعل أو حرف.

source: A preposition or conjunction.
ar: حرف أو عطف.

source: A verb.
ar: فعل.

source: Actions
ar: أعمال

source: Active participle
ar: اسم فاعل

source: Active Participle
ar: اسم فاعل

source: Add a new SQL migration.
ar: أضف ترحيل SQL جديد.

source: Add a new word
ar: أضف كلمة جديدة

source: Add a new word to your dictionary
ar: أضف كلمة جديدة إلى معجمك

source: Add a tag and press enter
ar: أضف وسمًا واضغط Enter

source: Add antonym
ar: أضف ضدا

source: Add Antonym
ar: أضف ضد

source: Add example
ar: أضف مثلا

source: Add Example
ar: أضف مثال

source: Add harf
ar: أضف حرف

source: Add Harf
ar: أضف حرف

source: Add Masdar
ar: أضف مصدر

source: Add plural
ar: أضف صيغة جمع

source: Add Plural
ar: أضف جمع

source: Add some to get started!
ar: أضف شيئًا لتبدأ!

source: Add some words to get started!
ar: أضف بعض الكلمات للبدء!

source: Add tag {inputValue}
ar: أضف علامة {inputValue}

source: Add tags to your word.
ar: أضف علامات إلى كلمتك.

source: Add word
ar: أضف كلمة

source: Additional Details
ar: تفاصيل إضافية

source: Again
ar: مرة أخرى

source: All done for today!
ar: انتهيت لليوم!

source: An Arabic definition of the word.
ar: تعريف عربية للكلمة.

source: An English translation of the sentence.
ar: ترجمة إنجليزية للجملة.

source: An English translation of the word.
ar: ترجمة إنجليزية للكلمة.

source: An unexpected error occurred. You can try reloading the page to fix it.
ar: حدث خطأ غير متوقع. يمكنك محاولة إعادة تحميل الصفحة لإصلاحه.

source: Answer
ar: الجواب

source: Antonym {0}
ar: الضد {0}

source: Antonym word
ar: كلمة مضادة

source: Antonyms
ar: أضداد

source: Any additional details about this form such as frequency of usage or context.
ar: أية تفاصيل إضافية عن هذه الصيغة مثلا تكرار الاستخدام أو السياق.

source: Any plural forms of the word.
ar: أية صيغ جمع للكلمة.

source: Any words that have the same ID will be overwritten.
ar: سيستبدل كل كلمات التي لديها نفس المعرف.

source: App language
ar: لغة التطبيق

source: Appearance
ar: المظهر

source: Arabic
ar: العربية

source: Arabic definition
ar: التعريف بالعربية

source: Arabic sentence
ar: الجملة بالعربية

source: Arabic verb form
ar: صيغة الفعل العربي

source: Arabic word
ar: الكلمة بالعربية

source: Are you sure you want to delete "{0}"?
ar: هل أنت متأكد من حذف "{0}"؟

source: Are you sure you want to delete this word? It will be removed from your dictionary and its flashcards will be deleted.<0/><1/><2>This action cannot be undone.</2>
ar: هل أنت متأكد أنك تريد حذف هذه الكلمة؟ سيتم إزالتها من معجمك وسيتم حذف البطاقات بها.<0/><1/><2>لا يمكن التراجع عن هذا الإجراء.</2>

source: Are you sure you want to delete this word? This action cannot be undone.
ar: هل أنت متأكد من حذف هذه الكلمة؟ لا يمكن التراجع عن هذا الإجراء.

source: Are you sure you want to delete your dictionary? All your words will be deleted permanently. This action cannot be undone. Please make sure to export your dictionary before deleting it.
ar: هل أنت متأكد من رغبتك في حذف معجمك؟ سيحذف جميع كلماتك بشكل دائم. لا يمكن التراجع عن هذا الإجراء. صدر معجمك قبل حذفه من فضلك.

source: Are you sure you want to reset this flashcard's progress? The word entry in the dictionary will not be modified, but its corresponding flashcards will be treated as new ones.<0/><1/><2>This action cannot be undone.</2>
ar: هل أنت متأكد أنك تريد إعادة تعيين تقدم بطاقة هذه؟ لن يتم تعديل إدخال الكلمة في المعجم، ولكن سيتم التعامل مع بطاقات بها على أنها بطاقات جديدة.<0/><1/><2>لا يمكن التراجع عن هذا الإجراء.</2>

source: Back
ar: رجوع

source: Back to top
ar: العودة إلى الأعلى

source: Backlog
ar: المتراكمة

source: Backlog cleared!
ar: تم مسح المتراكمات!

source: Bahar
ar: بحر

source: Basic Details
ar: تفاصيل أساسية

source: BETA
ar: بيتا

source: By signing in, you agree to our <0>Privacy Policy</0>
ar: بتسجيل الدخول، فإنك توافق على <0>سياسة الخصوصية</0>

source: Cancel
ar: ألغ

source: Cards due today or recently
ar: بطاقات مستحقة اليوم أو مؤخرًا

source: Cards overdue by more than 7 days
ar: بطاقات متأخرة أكثر من ٧ أيام

source: Category
ar: الباب

source: Cause:
ar: السبب:

source: Choose file
ar: اختر ملف

source: Clear
ar: امسح

source: Clear backlog
ar: امسح المتراكمات

source: Contact support
ar: اتصل بالدعم

source: Context
ar: السياق

source: Continue
ar: استمر

source: Continue with Email
ar: استمرّ مع بريد الإلكتروني

source: Control where antonyms appear during review
ar: تحكم في مكان ظهور الأضداد أثناء المراجعة

source: Copied!
ar: تم النسخ!

source: Copy
ar: انسخ

source: Create
ar: إنشاء

source: Create a deck to organize your flashcard reviews
ar: أنشئ مجموعة لتنظيم مراجعات بطاقاتك

source: Create a new deck
ar: إنشاء مجموعة جديدة

source: Create a new deck by choosing filters. The deck will be composed of the cards that match the filters.
ar: أنشئ مجموعة جديدة باختيار الفلاتر. ستكون المجموعة مكونة من البطاقات التي تطابق هذه الفلاتر.

source: Create deck
ar: أنشئ مجموعة

source: Create Deck
ar: إنشاء مجموعة

source: Create your first deck
ar: أنشئ مجموعتك الأولى

source: Customize how flashcards appear.
ar: خصص كيفيّة ظهور البطاقات.

source: Customize how the application looks for you.
ar: قم بتخصيص كيف يظهر التطبيق بالنسبة لك.

source: Danger Zone
ar: منطقة الخطر

source: Dark
ar: غامق

source: Debugging
ar: استكشاف الأخطاء

source: Deck created
ar: تم إنشاء المجموعة

source: Deck deleted
ar: تم حذف المجموعة

source: Deck Name
ar: اسم المجموعة

source: Deck successfully created!
ar: تم إنشاء المجموعة بنجاح!

source: Deck successfully deleted!
ar: تم حذف المجموعة بنجاح!

source: Deck successfully updated!
ar: تم تحديث المجموعة بنجاح!

source: Deck updated
ar: تم تحديث المجموعة

source: Decks
ar: المجموعات

source: Decks allow you to create subsets of your existing flashcards by using filters on your dictionary which you can then study individually.
ar: تتيح لك المجموعات إنشاء مجموعات فرعية من بطاقاتك التعليمية الموجودة باستخدام الفلاتر على قاموسك، والتي يمكنك دراستها بشكل فردي.

source: Definition
ar: التعريف

source: Delete
ar: احذف

source: Delete All Data
ar: حذف جميع البيانات

source: Delete Deck
ar: حذف المجموعة

source: Delete Dictionary
ar: حذف المعجم

source: Delete Everything
ar: حذف كل شيء

source: Delete this word?
ar: حذف هذه الكلمة؟

source: Delete word
ar: حذف الكلمة

source: Delete your dictionary?
ar: هل تريد أن تحذف معجمك؟

source: Description
ar: الوصف

source: Details
ar: تفاصيل

source: Details:
ar: التفاصيل:

source: Dictionary
ar: معجم

source: Dictionary deleted
ar: تم حذف المعجم

source: Diptote
ar: ممنوع من الصرف

source: Discard
ar: ألغ

source: Dismiss
ar: اغلق

source: Don't show
ar: لا تعرض

source: Dual
ar: المثنى

source: e.g. ك ت ب
ar: مثال: ك ت ب

source: Easy
ar: سهل

source: Edit
ar: عدَل

source: Edit {word}
ar: حرّر {word}

source: Edit Deck
ar: تعديل المجموعة

source: Edit word
ar: تعديل الكلمة

source: Edit your deck
ar: عدّل مجموعتك

source: Edit your deck by choosing filters. The deck will be composed of the cards that match the filters.
ar: عدّل مجموعتك من خلال اختيار الفلاتر. ستتكون المجموعة من البطاقات التي تطابق الفلاتر.

source: Email
ar: البريد الإلكتروني

source: English
ar: الإنجليزية

source: English translation
ar: الترجمة بالإنجليزية

source: Enter a deck name
ar: أدخل اسم المجموعة

source: Enter a description for your migration
ar: أدخل وصفًا لترحيلك

source: Enter deck name
ar: أدخل اسم المجموعة

source: Enter your 6-digit code from your email
ar: ادخل رمزك المكون من ٦ أرقام من بريدك الإلكتروني

source: Enter your SQL migration script here
ar: أدخل نص ترحيل SQL هنا

source: Entry {arrayIndex}
ar: العنصر {arrayIndex}

source: Example {0}
ar: المثال {0}

source: Example usages of the word in different contexts.
ar: استخدامات مثالية للكلمة في سياقات مختلفة.

source: Examples
ar: أمثلة

source: Export
ar: صدر

source: Export completed with issues
ar: اكتمل التصدير مع وجود مشاكل

source: Export failed!
ar: فشل التصدير!

source: Export with flashcards
ar: تصدير مع البطاقات

source: Export your dictionary
ar: تصدير معجمك

source: Exporting dictionary with flaschards will save your flashcard progress along with all the content in your dictionary. Use this option if you want to make a backup of your data.<0/><1/>Exporting your dictionary without flashcards will not save any flashcard progress. Use this option if you want to share your dictionary.<2/><3/><4>Warning</4>: Importing your file without flashcards will reset all of your flashcards.
ar: تصدير المعجم مع البطاقات سيحفظ تقدم البطاقات بالإضافة إلى كل المحتوى في معجمك. استخدم هذا الخيار إذا كنت ترغب في إنشاء نسخة احتياطية من بياناتك.<0/><1/>تصدير المعجم بدون البطاقات لن يحفظ أي تقدم للبطاقات. استخدم هذا الخيار إذا كنت ترغب في مشاركة معجمك.<2/><3/><4>تحذير</4>: استيراد ملفك بدون البطاقات سيؤدي إلى إعادة تعيين جميع البطاقات.

source: Expression
ar: عبارة

source: Failed to add word
ar: فشل إضافة الكلمة

source: Failed to add word!
ar: فشل إضافة الكلمة!

source: Failed to apply migration to local database.
ar: فشل تطبيق الترحيل على قاعدة البيانات المحلية.

source: Failed to clear backlog
ar: فشل مسح المتراكمات

source: Failed to create deck
ar: فشل إنشاء المجموعة

source: Failed to delete deck
ar: فشل حذف المجموعة

source: Failed to delete dictionary
ar: فشل حذف المعجم

source: Failed to delete word
ar: فشل حذف الكلمة

source: Failed to delete!
ar: فشل الحذف!

source: Failed to reset local data
ar: فشل في إعادة تعيين البيانات المحلية

source: Failed to retrieve data from local database.
ar: فشل في استرجاع البيانات من قاعدة البيانات المحلية.

source: Failed to retrieve database information.
ar: فشل استرجاع معلومات قاعدة البيانات.

source: Failed to update deck
ar: فشل تحديث المجموعة

source: Failed to update flashcard settings.
ar: فشل في تحديث إعدادات البطاقة.

source: Failed to update settings
ar: فشل تحديث الإعدادات

source: Failed to update the word!
ar: فشل في تحديث الكلمة!

source: Failed to update word
ar: فشل تحديث الكلمة

source: Failed to upload migration
ar: فشل تحميل الترحيل

source: Feminine
ar: مؤنّث

source: Fi'l
ar: فعل

source: Flashcard settings updated!
ar: تم تحديث إعدادات البطاقة!

source: Flashcards
ar: بطاقات

source: Follows your device language
ar: يتبع لغة جهازك

source: Follows your system settings
ar: يتبع إعدادات النظام

source: For example, the word
ar: مثلا الكلمة

source: Form
ar: الوزن

source: Gender
ar: جنس

source: Go back
ar: ارجع

source: Good
ar: حسن

source: Great work on the backlog! You still have {0} regular reviews.
ar: أحسنت في المتراكمات! لا يزال لديك {0} مراجعات عادية.

source: Great work! Come back later for more reviews.
ar: عمل رائع! عد لاحقًا لمزيد من المراجعات.

source: Hard
ar: صعب

source: Harf
ar: حرف

source: Harf {0}
ar: الحرف {0}

source: Hidden
ar: مخفي

source: Hide details
ar: إخفاء التفاصيل

source: Hint
ar: تلميح

source: Home
ar: منزل

source: How should antonyms be shown in flashcards?
ar: كيف ينبغي عرض الأضداد في بطاقات؟

source: How the word is categorized based on its type or context.
ar: طريقة تصنف الكلمة حسب نوعها أو سياقها.

source: Huroof
ar: حروف

source: ID:
ar: المعرف:

source: if needed.
ar: إذا لزم الأمر.

source: If you're experiencing sync issues or data not loading correctly, you can reset your local data and re-sync from the server.
ar: إذا كنت تواجه مشاكل في المزامنة أو عدم تحميل البيانات بشكل صحيح، يمكنك إعادة تعيين بياناتك المحلية وإعادة المزامنة من الخادم.

source: Imperative
ar: الأمر

source: Import
ar: استورد

source: Import failed!
ar: فشل الاستيراد!

source: Include English to Arabic flashcards
ar: تضمين بطاقات الإنجليزية إلى العربية

source: Incorrect file type
ar: نوع الملف غير صحيح

source: Indeclinable
ar: مبنى

source: Inflection
ar: إعراب

source: Information such as the word's root, meaning, and examples.
ar: معلومات مثلا الجذر أو المعنى أو الأمثلة.

source: Invalid datetime format
ar: الصيغة الزمنية غير صالحة

source: Invalid string format
ar: صيغة النص غير صالحة

source: Invalid value. Expected one of: {0}
ar: قيمة غير صالحة. يجب أن تكون إحدى القيم التالية: {0}

source: Ism
ar: اسم

source: Language
ar: اللغة

source: Light
ar: فاتح

source: Loading details...
ar: جارٍ تحميل التفاصيل...

source: Loading your dictionary...
ar: جارٍ تحميل معجمك...

source: Loading...
ar: جارٍ التحميل...

source: Log in to your existing account or sign up for a new one
ar: قم بتسجيل الدخول إلى حسابك الحالي أو قم بالتسجيل للحصول على حساب جديد

source: Logout
ar: تسجيل الخروج

source: Manage your decks and study them.
ar: إدارة مجموعاتك ودراستها.

source: Manage your dictionary.
ar: إدارة معجمك.

source: Masadir
ar: مصادر

source: Masculine
ar: مذكر

source: Masdar
ar: مصدر

source: Masdar {0}
ar: المصدر {0}

source: Meaning
ar: المعنى

source: Meaning with this preposition
ar: المعنى مع هذا الحرف

source: Menu
ar: القائمة

source: Migration successfully registered.
ar: تم تسجيل الترحيل بنجاح.

source: Morphology
ar: الصرف

source: Morphology only applies to isms and fi'ls. This section will be hidden if the type of the word is set to anything else.
ar: الصرف ينطبق فقط على الأسماء والأفعال. سيتم إخفاء هذا القسم إذا تم تعيين نوع الكلمة إلى أي شيء آخر.

source: My Account
ar: حسابي

source: Name
ar: اسم

source: Navigation menu
ar: قائمة التنقل

source: No backlog cards to clear.
ar: لا توجد بطاقات متراكمة للمسح.

source: No cards due
ar: لا توجد بطاقات مستحقة

source: No decks yet
ar: لا توجد مجموعات بعد

source: No file chosen
ar: لم يتم اختيار ملف

source: No results found
ar: لم يتم العثور على نتائج

source: Noun
ar: اسم

source: Noun Morphology
ar: صرف الاسم

source: Or continue with
ar: أو استمر مع

source: Particle
ar: حرف

source: Passive participle
ar: اسم مفعول

source: Passive Participle
ar: اسم مفعول

source: Past
ar: الماضي

source: Past tense
ar: الماضي

source: Past Tense
ar: الماضي

source: Permanently delete all your data including words, flashcards, and decks.
ar: حذف جميع بياناتك نهائيًا بما في ذلك الكلمات والبطاقات والمجموعات.

source: Please contact <0>support</0> with the following details:
ar: يرجى الاتصال <0>بالدعم</0> مع التفاصيل التالية:

source: Please enter a deck name
ar: الرجاء إدخال اسم المجموعة

source: Please select a JSON file with your dictionary.
ar: اختر ملف JSON لمعجمك من فضلك.

source: Please try again or reload the page.
ar: حاول مرة أخرى أو أعد تحميل الصفحة.

source: Please try again.
ar: حاول مرّة أخرى.

source: Plural
ar: الجمع

source: Plural {0}
ar: صيغة الجمع {0}

source: Plural form
ar: صيغة الجمع

source: Plurals
ar: صيغ جمع

source: Preposition
ar: حرف

source: Prepositions (Huroof)
ar: حروف الجر

source: Prepositions (huroof) that can be used with the verb to change its meaning.
ar: الحروف التي يمكن استخدامها مع الفعل لتغيير معناه.

source: Present
ar: المضارع

source: Present tense
ar: المضارع

source: Present Tense
ar: المضارع

source: Reload
ar: أعد التحميل

source: Remove
ar: احذف

source: Required field
ar: حقل مطلوب

source: Reschedule all backlog cards by grading them as "Hard".
ar: أعد جدولة جميع البطاقات المتراكمة بتقييمها كـ "صعب".

source: Reset and re-sync
ar: إعادة التعيين والمزامنة

source: Reset flashcard
ar: أعد البطاقة

source: Reset flashcard progress?
ar: إعادة تعيين تقدم البطاقة؟

source: Reset local data
ar: إعادة تعيين البيانات المحلية

source: Reset local data and re-sync?
ar: إعادة تعيين البيانات المحلية والمزامنة؟

source: Resetting local data...
ar: جارٍ إعادة تعيين البيانات المحلية...

source: Reverse flashcards
ar: بطاقات العكسية

source: Review
ar: مراجعة

source: Review flashcards
ar: ادرس البطاقات

source: Review flashcards ({0} in backlog)
ar: راجع البطاقات ({0} متراكمة)

source: Review flashcards with spaced repetition
ar: راجع البطاقات بالتكرار المتباعد

source: Review your Arabic flashcards and grade your understanding with Again, Hard, Good, or Easy options to adjust scheduling.
ar: راجع بطاقاتك العربية وقيم فهمك باستخدام خيارات مرة أخرى أو صعب أو جيد أو سهل لتعديل الجدولة.

source: Root letters
ar: الجذر

source: Root Letters
ar: الحروف الأصلية

source: Save
ar: احفظ

source: Save changes
ar: حفظ التغييرات

source: Save Changes
ar: حفظ التغييرات

source: Schema Migrations
ar: ترحيلات المخطط

source: Search for a tag...
ar: ابحث عن علامة...

source: Search...
ar: ابحث...

source: Searching...
ar: يبحث...

source: Select gender
ar: اختر جنسا

source: Select inflection
ar: اختر إعرابا

source: Select the types of words that you want to include in the deck.
ar: حدد أنواع الكلمات التي تريد تضمينها في المجموعة.

source: Select type
ar: اختر الجنس

source: Sentence
ar: جملة

source: Separate letters with spaces or commas
ar: افصل الحروف بمسافات أو فواصل

source: Settings
ar: الإعدادات

source: Show after revealing the answer
ar: عرض بعد كشف الإجابة

source: Show answer
ar: اعرض الجواب

source: Show antonyms
ar: إظهار الأضداد

source: Show as a hint
ar: عرض كتلميح

source: Show details
ar: عرض التفاصيل

source: Show English to Arabic flashcards.
ar: اعرض بطاقات من الإنجليزية إلى العربية.

source: Show reverse flashcards
ar: إظهار البطاقات العكسية

source: Singular
ar: مفرد

source: Some dictionary entries couldn't be loaded
ar: تعذر تحميل بعض إدخالات المعجم

source: Something went wrong
ar: حدث خطأ ما

source: SQL Script
ar: نص SQL

source: Still not working?
ar: لا يزال لا يعمل؟

source: Study
ar: أدرس

source: Successfully added word!
ar: تم إضافة الكلمة بنجاح!

source: Successfully deleted!
ar: نجح الحذف!

source: Successfully exported!
ar: تم التصدير بنجاح!

source: Successfully imported!
ar: تم الاستيراد بنجاح!

source: Successfully reset the flashcard.
ar: تمت إعادة تعيين البطاقة بنجاح.

source: Successfully updated the word!
ar: حدثت الكلمة بنجاح!

source: Sync error
ar: خطأ في المزامنة

source: System
ar: نظام

source: Tags
ar: علامات

source: That code is invalid.
ar: هذا الشفرة غير صالح.

source: That email is invalid.
ar: هذا البريد الإلكتروني غير صالح.

source: That is not valid JSON.
ar: هذا ليس JSON صالح.

source: The app may be open in another tab. Try closing other tabs and refreshing this page.
ar: قد يكون التطبيق مفتوحًا في علامة تبويب أخرى. حاول إغلاق علامات التبويب الأخرى وتحديث هذه الصفحة.

source: The context of the sentence, ex. formal or colloquial.
ar: سياق الجملة مثلا رسمي أو عامي.

source: The deck "{0}" has been deleted.
ar: تم حذف المجموعة "{0}".

source: The form of the verb ex. I, II, III, IV, etc...
ar: صيغة الفعل مثلا I, II, III, IV, هكذا و هكذا...

source: The form of the verb in Arabic ex. فعل, أفعل, استفعل, etc...
ar: صيغة الفعل بالعربية مثلا فعل, أفعل, استفعل, هكذا و هكذا...

source: The local database is locked by another session.
ar: قاعدة البيانات المحلية مقفلة بواسطة جلسة أخرى.

source: The meaning of the verb when used with the harf.
ar: معنى الفعل إذا استعمل مع الحرف.

source: The morphological breakdown of the word.
ar: التصريف.

source: The root letters of the word. The input can be separated by commas, spaces or have no delimeter ex. فعل or ف, ع, ل or ف ع ل.
ar: الحروف الجذرية للكلمة. يمكن فصل المدخلات بفواصل أو مسافات أو لا تحتوي على محدد مثلا فعل أو ف، ع، ل أو ف ع ل.

source: The word has been added to your dictionary.
ar: تمت إضافة الكلمة إلى معجمك.

source: The word has been updated.
ar: حدثت الكلمة.

source: Theme
ar: المظهر

source: There was an error adding your word. Please try again.
ar: حدث خطأ أثناء إضافة كلمتك. حاول مرة اخرى.

source: There was an error clearing your backlog.
ar: حدث خطأ أثناء مسح المتراكمات.

source: There was an error creating the deck
ar: حدث خطأ أثناء إنشاء المجموعة

source: There was an error deleting your dictionary. Please try again later.
ar: حدث خطأ أثناء حذف معجمك. حاول مرة أخرى لاحقا من فضلك.

source: There was an error exporting your dictionary. Please try again later.
ar: حدث خطأ أثناء تصدير معجمك. حاول مرة أخرى لاحقا من فضلك.

source: There was an error importing your dictionary. Please try again later.
ar: حدث خطأ أثناء استيراد لمعجمك. حاول مرة أخرى لاحقا.

source: There was an error syncing your data. Please try resetting local data in Settings.
ar: حدث خطأ في مزامنة بياناتك. حاول إعادة تعيين البيانات المحلية من الإعدادات.

source: There was an error syncing your data. Your local data is still available.
ar: حدث خطأ في مزامنة بياناتك. بياناتك المحلية لا تزال متاحة.

source: There was an error updating the deck
ar: حدث خطأ أثناء تحديث المجموعة

source: There was an error updating your flashcard settings.
ar: حدث خطأ أثناء تحديث إعدادات بطاقاتك.

source: There was an error updating your word. Please try again.
ar: حدث خطأ أثناء تحديث كلمتك. حاول مرة أخرى.

source: There was an error uploading your SQL migration
ar: حدث خطأ أثناء تحميل ترحيل SQL الخاص بك

source: There was an error when indexing your data in the search engine.
ar: حدث خطأ أثناء فهرسة بياناتك في محرك البحث.

source: There was an unexpected error. Please try again.
ar: حدث خطأ غير متوقع. حاول مرة أخرى من فضلك.

source: There's a temporary issue loading your account. Please try reloading the page.
ar: هناك مشكلة مؤقتة في تحميل حسابك. حاول إعادة تحميل الصفحة من فضلك.

source: This field is required.
ar: هذه الخانة لازم.

source: This is case insensitive.
ar: هذا حالة غير حساسة.

source: This is the name of your deck.
ar: هذا هو اسم مجموعتك.

source: This refers to how many case endings the word can take.
ar: هذا هو إعراب الكلمة.
